Revit 2027 API
ExtendedPropertiesLinkValues.AddValue(ForgeTypeId, Int32) Method
 Add an integer value for a given schema id.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AddValue(
	ForgeTypeId schemaId,
	int value
)
Public Function AddValue (
	schemaId As ForgeTypeId,
	value As Integer
) As Boolean
public:
bool AddValue(
	ForgeTypeId^ schemaId,
	int value
)
member AddValue :
        schemaId : ForgeTypeId *
        value : int -> bool
Parameters
schemaId ForgeTypeId
 Identifier of the schema.
value Int32
 The integer value.
Return Value
Boolean
 True if the data was added, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExtendedPropertiesLinkValues Class
AddValue Overload
Autodesk.Revit.DB.ExternalData Namespace